Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, or the extrasensory powers.

source: ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to the meditative stabilities or the dhāraṇī gateways.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to the ten powers of the tathāgatas.

source: མི་འཇིགས་པ་བཞི་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to the four fearlessnesses, the four kinds of exact knowledge, or the eighteen distinct qualities of the buddhas.

source: བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་བར་དུ་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to [the goals], up to and including unsurpassed, complete enlightenment.

source: སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to the buddhafields that are to be refined.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལྷུར་ལེན་པ་མ་ཡིན།
en: They do not attach importance to the beings who are to be brought to maturity.

source: སངས་རྒྱས་བལྟ་བ་ལྷུར་ལེན་པ་མ་ཡིན། དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ལྷུར་ལེན་པ་མ་ཡིན་ནོ།
en: They do not attach importance to beholding the buddhas, and they do not attach importance to cultivating the roots of virtue.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའི་ཕྱིར། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གང་ལ་ལྷུར་བླང་པ་བསྐྱེད་པ་དང་། གང་གིས་བསྐྱེད་པ་དང་། གང་ལ་བསྐྱེད་པར་བྱ་བའི་ཆོས་དེ་ལྟ་བུ་གང་ཡང་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, Subhūti, it is because all phenomena are empty of intrinsic defining characteristics and therefore those bodhisattva great beings do not observe anything to which, through which, or with respect to which they should cultivate the attachment of importance.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའ་དང་མཚུངས་པ་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་དེ། རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པའོ།
en: If you ask why, Subhūti, it is because all phenomena are similar to space, with the essential nature of nonentity, and empty of intrinsic defining characteristics. “

source: །རབ་འབྱོར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ཡིད་ལ་བྱེད་པ་དེ་དང་ལྡན་པས། སྤྱོད་ལམ་བཞིར་འགྲོ་འམ། འོང་ན་ཡང་ནོར་པའི་སེམས་ཀྱིས་མི་འགྲོ། ནོར་པའི་སེམས་ཀྱིས་མི་འོང་། ནོར་བའི་སེམས་ཀྱིས་མི་སྡོད།
en: Subhūti, irreversible bodhisattva great beings who have that as the focus of their attention come and go in accordance with the four norms of behavior, but they do not come with a bewildered mind, they do not go with a bewildered mind, they do not stand with a bewildered mind, they do not walk with a bewildered mind, {Ki.

source: ནོར་པའི་སེམས་ཀྱིས་མི་འཆག །ནོར་པའི་སེམས་ཀྱིས་མི་འདུག །ནོར་པའི་སེམས་ཀྱིས་མི་ཉལ་ཏེ། དེ་དྲན་བཞིན་དུ་འགྲོའོ།
en: IV: 156} they do not sit with a bewildered mind, and they do not lie down with a bewildered mind.

source: །དྲན་བཞིན་དུ་འོང་ངོ་། །དྲན་བཞིན་དུ་འཆག་གོ། །དྲན་བཞིན་དུ་སྡོད་དོ། །དྲན་བཞིན་དུ་འདུག་གོ། །དྲན་བཞིན་དུ་ཉལ་ལོ།
en: They come mindfully, they go mindfully, they walk mindfully, they stand mindfully, they sit mindfully, and they lie down mindfully.

source: །རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་། མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པ་ཞེས་བྱའོ།
en: Subhūti, bodhisattva great beings who possess those attributes, indications, and signs are said to be irreversible. “

source: །རབ་འབྱོར་གཞན་ཡང་གལ་ཏེ་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཁྱིམ་ན་གནས་ཀྱང་ཐབས་མཁས་པས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འདོད་པའི་ཡོན་ཏན་ལྔ་ཉེ་བར་ལེན་ཏོ། །དེ་སེམས་ཅན་རྣམས་ལ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་སྟེ། ཟས་འདོད་པ་ལ་ཟས་སྐོམ་འདོད་པ་ལ་སྐོམ། བཞོན་པ་འདོད་པ་ལ་བཞོན་པ། གོས་འདོད་པ་ལ་གོས། མལ་ཆ་འདོད་པ་ལ་མལ་ཆ། མེ་ཏོག་འདོད་པ་ལ་མེ་ཏོག །བདུག་པ་འདོད་པ་ལ་བདུག་པ།
en: Moreover, Subhūti, even if bodhisattva great beings who are irreversible dwell as householders, through skill in means they acquire the five desirable objects of the senses in order to bring beings to maturity.

source: སྤོས་འདོད་པ་ལ་སྤོས། འཕྲེང་བ་འདོད་པ་ལ་འཕྲེང་བ། བྱུག་པ་འདོད་པ་ལ་བྱུག་པ་གནས་འདོད་པ་ལ་གནས། ནོར་དང་འབྲུ་དང་ནོར་བུ་དང་མུ་ཏིག་དང་བཻཌཱུརྱ་དང་དུང་དང་།
en: They dispense gifts to beings.

source: མན་ཤེལ་དང་བྱི་རུ་དང་གསེར་དང་། དངུལ་འདོད་པ་ལ་ནོར་དང་འབྲུ་དང་། ནོར་བུ་དང་མུ་ཏིག་དང་བཻཌཱུརྱ་དང་དུང་དང་མེན་ཤེལ་དང་། བྱི་རུ་དང་གསེར་དང་དངུལ་དང་འཚོག་ཆས་དང་། ཡོ་བྱད་གཞན་དང་།
en: That is to say, they dispense food to those who need food; drink to those who need drink; vehicles to those who need vehicles; clothing to those who need clothing; bedding to those who need bedding; flowers to those who need flowers; garlands to those who need garlands; unguents to those who need unguents; dwellings to those who need dwellings; wealth, grain, gems, pearls, beryl, conch, quartz, coral, gold, and silver to those in need of wealth, grain, gems, pearls, beryl, conch, quartz, coral, gold, and silver, and they dispense other provisions and resources to those in need of other things.

source: གཞན་དག་ཀྱང་དེ་འདོད་པ་རྣམས་ལ་ཡོངས་སུ་གཏོང་སྟེ། དེ་བདག་ཀྱང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ལ། གཞན་ཡང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves practice the perfection of generosity and they also encourage others to acquire the perfection of generosity.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པའི་ལེགས་པ་བརྗོད་དོ། གཞན་གང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་དག་གི་ཡང་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་དོ།
en: They praise the perfection of generosity and they also praise and take empathetic delight in others who practice the perfection of generosity.

source: །བདག་ཀྱང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པ་དང་བརྩོན་འགྲུས་དང་། བསམ་གཏན་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དོ། གཞན་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, and they also encourage others to acquire the perfection of wisdom [and so forth].

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ལེགས་པ་བརྗོད་དོ། །གཞན་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་དག་གི་ཡང་ལེགས་པ་བརྗོད་ཅིང་འཐུན་པས་དགའ་བར་བྱེད་དོ།
en: They praise the perfection of wisdom [and so forth] and they also praise and take empathetic delight in others who practice the perfection of wisdom [and so forth]. “

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཁྱིམ་ན་གནས་ན་འཛམ་བུའི་གླིང་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་བཀང་ཞིང་སྦྱིན་པ་ཡོངས་སུ་གཏོང་།
en: Moreover, Subhūti, when bodhisattva great beings who are irreversible dwell as householders, they fill Jambudvīpa with diverse precious things and offer these as gifts.

source: གླིང་བཞི་པའི་འཇིག་རྟེན་གྱི་ཁམས་དང་། སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་དང་། སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དང་། སྟོང་གི་འཇིག་རྟེན་གྱི་ཁམས་དང་། སྟོང་གཉིས་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་དང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་རིན་པོ་ཆེ་སྣ་བདུན་གྱིས་ཡོངས་སུ་བཀང་ཞིང་སྦྱིན་པ་ཡོངས་སུ་གཏོང་ཡང་།
en: They fill the world system of the four continents, the world system of the chiliocosm, the world system of the dichiliocosm, and the world system of the great trichiliocosm with diverse precious things, and offer these as gifts.

source: དེ་འདོད་པ་ལ་ཡོངས་སུ་མི་སྤྱོད་དེ། རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་ཚངས་པར་སྤྱོད་པ་ཡིན།
en: Yet they do not indulge in those sensual pleasures, and they always practice chastity, without interruption.

source: གནོད་པ་གང་གིས་གཞན་མི་དགའ་བར་འགྱུར་བའི་གནོད་པ་དེ་ལྟ་བུ་གང་ཡང་མི་སྤྱོད་དེ།
en: They generate nothing despicable that would cause others to dislike them.

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཕྱི་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ནི་རིང་པོ་མི་ཐོགས་པར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ། འདི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཀྱང་། བདག་གིས་རྟག་ཏུ་རྒྱུན་མི་འཆད་པར་རྗེས་སུ་འབྲང་བར་བྱའོ་ཞེས་ཡོངས་སུ་བསྲུང་བའི་ཕྱིར། གནོད་སྦྱིན་ལག་ན་རྡོ་རྗེ་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་རྗེས་སུ་འབྲང་ངོ་།
en: Moreover, Subhūti, the yakṣa Vajrapāṇi will always follow without interruption behind irreversible bodhisattva great beings in order to guard them, thinking that these bodhisattva great beings will soon attain consummate buddhahood in unsurpassed, complete enlightenment, and that even after they have attained consummate buddhahood in unsurpassed, complete enlightenment, he will always follow them without interruption.

source: །ཇི་ཙམ་དུ་ལག་ན་རྡོ་རྗེའི་རིགས་རྣམས་རྟག་ཏུ་རྒྱུན་མི་ཆད་པར་རྗེས་སུ་འབྲང་བ་དེ་ཙམ་དུ་དེ་ལ་མིའམ། མི་མ་ཡིན་པ་དག་གིས་གནོད་པར་མི་ནུས་ཏེ།
en: To the extent that those in the enlightened family of Vajrapāṇi will always follow them without interruption, to that extent they can never be harmed by humans or nonhumans.

source: དེ་ལ་འཇིག་རྟེན་ན་ལྷའམ། བདུད་དམ། ཚངས་པའམ། གང་སུས་ཀྱང་ཆོས་དང་འཐུན་པར་ཐུབ་པ་མེད་དེ།
en: In conformity with the Dharma, they can never be overcome by any god, demon, Brahmā, or anyone else in the world. {

source: དེའི་སེམས་བྱང་ཆུབ་ཡིད་ལ་བྱེད་པ་ནས། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ཀྱི་བར་དུ་རྣམ་པར་འཁྲུག་པ་མེད་དོ།
en: Ki.IV: 157} Until they have attained manifest buddhahood in unsurpassed, complete enlightenment, their minds will not be distracted from attention to enlightenment.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེའི་དབང་པོ་འདི་ལྟ་སྟེ། མིག་གི་དབང་པོ་དང་། རྣ་བའི་དབང་པོ་དང་། སྣའི་དབང་པོ་དང་། ལྕེའི་དབང་པོ་དང་། ལུས་ཀྱི་དབང་པོ་དང་། ཡིད་ཀྱི་དབང་པོ་དང་། དང་བའི་དབང་པོ་དང་། བརྩོན་འགྲུས་ཀྱི་དབང་པོ་དང་། དྲན་པའི་དབང་པོ་དང་། ཏིང་ངེ་འཛིན་གྱི་དབང་པོ་དང་། ཤེས་རབ་ཀྱི་དབང་པོ་དག་མ་ཚང་བར་མི་འགྱུར་རོ།
en: The faculties of those bodhisattva great beings, comprising the faculty of the eyes, the faculty of the ears, the faculty of the nose, the faculty of the tongue, the faculty of the body, the mental faculty, the faculty of faith, the faculty of perseverance, the faculty of mindfulness, the faculty of meditative stability, and the faculty of wisdom, will not be deficient.

source: །དེ་ནི་སྐྱེས་བུ་དམ་པར་འགྱུར་ཏེ། སྐྱེས་བུ་དམའ་བ་མ་ཡིན་ནོ།
en: They will be saintly persons and they will not be inferior persons.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ཙམ་གྱིས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐྱེས་བུ་དམ་པར་འགྱུར་ཞིང་སྐྱེས་བུ་དམའ་བ་མ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, to what extent will bodhisattva great beings be saintly persons and not be inferior persons?” “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནམ་བྱང་ཆུབ་ཀྱི་སེམས་མི་འཁྲུག་པ་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྐྱེས་བུ་དམ་པར་འགྱུར་ཏེ། སྐྱེས་བུ་དམའ་བ་མ་ཡིན་ནོ། །རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་།
en: Subhūti,” replied the Blessed One, “when bodhisattva great beings are never distracted from the mind of enlightenment, those bodhisattva great beings will be saintly persons and not inferior persons.

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་བྱང་ཆུབ་ཡིད་ལ་བྱ་བ་དང་ལྡན་ཞིང་།
en: Moreover, Subhūti, those irreversible bodhisattva great beings have enlightenment as the focus of their attention.

source: བུད་མེད་ཟེ་སློང་བ་དང་། དབང་དུ་འགྱུར་བའི་སྔགས་དང་། ཚིག་གང་ཅི་ཡང་རུང་སྟེ། རྩི་དེ་དག་ཐམས་ཅད་དུ་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་ཀྱི་ཐམས་ཅད་མི་སྦྱོར། སྦྱོར་དུ་མི་འཇུག་སྟེ།
en: They in no way whatsoever concoct potions—any overpowering spells or words that attract women—nor do they incite anyone to do so.

source: ཟེ་སློང་བའི་བག་གཞན་དང་གཞན་དག་ཀྱང་མི་བྱེད་དོ།
en: That is to say, they do not indulge in any hint of harmful attraction.

source: །བུད་མེད་དམ་སྐྱེས་པ་གང་ཡང་རུང་སྟེ། དེ་དག་ལ་ཡོངས་སུ་བསྟན་པའི་ཆོ་འཕྲུལ་མི་བྱེད་དོ།
en: They do not make miraculous predictions to any women or men.

source: །བུ་འམ་བུ་མོ་རིགས་ཀྱི་ལྷ་ལྟ་བུ་ཡོད་པར་འགྱུར་རོ་ཞེའམ།
en: They do not make miraculous predictions, claiming, ‘You will have a son or daughter who belongs to the class of gods or divine princes!’

source: ཚེ་རིང་བར་འགྱུར་རོ་ཞེས་ཡོངས་སུ་སྟོན་པའི་ཆོ་འཕྲུལ་མི་བྱེད་དོ།
en: or ‘You will have a long life!’

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་བའི་ཆོས་རྣམས་ལ། མཚན་མ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་སྟེ།
en: If you ask why, Subhūti, it is because bodhisattva great beings do not observe any signs in phenomena that are empty of intrinsic defining characteristics.

source: དེས་མཚན་མ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བས་འཚེ་བ་ཡོངས་སུ་དག་པ་ཡིན་ཏེ།
en: Since they do not observe any such signs, their livelihood is perfectly pure.

source: །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་གང་དང་ཚུལ་གང་དང་། མཚན་མ་གང་དང་ལྡན་པས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱ་བའི་རྣམ་པ་དང་ཚུལ་དང་།
en: Moreover, Subhūti, I shall [now] disclose the attributes, indications, and signs through which irreversible bodhisattva great beings are known to be irreversible.

source: མཚན་མ་དེ་དག་བསྟན་གྱིས་ཤིན་དུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་བཤད་དོ།
en: Listen well and pay attention to them! I will explain them!” “

source: །བཅོམ་ལྡན་འདས་དེ་ལྟར་བགྱིའོ་ཞེས་གསོལ་ནས།
en: Please do so, Blessed Lord!” he replied.

source: ཚེ་དང་ལྡན་པ་རབ་འབྱོར་བཅོམ་ལྡན་འདས་ལ་ཕྱིར་ཉན་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དེ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བྱང་ཆུབ་ཡིད་ལ་བྱེད་པ་དང་མི་འབྲལ་བ་ཡིན་ཏེ།
en: The venerable Subhūti then listened to the Blessed One, and the Blessed One spoke as follows: “In this regard, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they do not lack the modes of attention to enlightenment.

source: ཕུང་པོའི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས།
en: They are not preoccupied with the psycho-physical aggregates, {Ki.

source: སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་སོ།
en: IV: 158} nor do they preoccupy themselves with the sense fields, the sensory elements, or the links of dependent origination.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཕུང་པོ་སྟོང་པ་ཉིད་དང་། སྐྱེ་མཆེད་སྟོང་པ་ཉིད་དང་། ཁམས་སྟོང་པ་ཉིད་དང་། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་སྟོང་པ་ཉིད་ཤིན་དུ་ཡིད་ལ་བྱས་པ་ཡིན།
en: If you ask why, Subhūti, it is because those bodhisattva great beings focus their attention completely on the emptiness of the psycho-physical aggregates, the emptiness of the sense fields, the emptiness of the sensory elements, and the emptiness of the links of dependent origination.

source: དེ་འདུ་འཛིའི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་ཏེ།
en: They are not preoccupied with social distractions.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་སེམས་ཅན་སྟོང་པ་ཉིད་ཤིན་དུ་ཡིད་ལ་བྱས་པ་ཡིན།
en: If you ask why, it is because those bodhisattva great beings focus their attention completely on the emptiness of beings.

source: དེ་རྒྱལ་པོའི་གཏམ་གྱི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་ཏེ།
en: They are not preoccupied with talk of kings.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་རང་བཞིན་སྟོང་པ་ཉིད་ལ་གནས་པས། ཆོས་གང་ལ་ཡང་བཟང་པོའམ། ངན་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because, abiding in the emptiness of inherent existence, they do not observe anything at all as superior or inferior.

source: །དེ་རྐུན་པོའི་གཏམ་གྱི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་ཏེ།
en: They are not preoccupied with talk of robbers.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པས། ཆོས་གང་ལ་ཡང་བླང་པ་འམ། དབྲོག་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because all phenomena are empty of intrinsic defining characteristics and so they do not observe anything at all that could be acquired or stolen.

source: །དེ་གཡུལ་གྱི་གཏམ་གྱི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་ཏེ།
en: They are not preoccupied with talk of battles.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་རང་བཞིན་སྟོང་པ་ཉིད་ལ་གནས་པས། ཆོས་གང་ཡང་ཉུང་ངུ་འམ་མང་པོར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because, excellently abiding in the emptiness of inherent existence, they do not observe anything at all in terms of minorities and majorities.

source: །དེ་དམག་གི་གཏམ་གྱི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་ཏེ།
en: They are not preoccupied with talk of warfare.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་ཆོས་ཐམས་ཅད་ཀྱི་དེ་བཞིན་ཉིད་ལ་གནས་པས། ཆོས་གང་ལ་ཡང་བྱམས་པའམ་ཞེ་སྡང་པ་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because, abiding in the real nature of all phenomena, they do not observe affection or hatred.

source: །དེ་གྲོང་གི་གཏམ་གྱི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་ཏེ་དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: They are not preoccupied with the talk of towns.

source: དེ་ནི་འདི་ལྟར་དེ་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ལ་གནས་པས། ཆོས་གང་ཡང་ཚོགས་སམ་ཚོགས་མ་ཡིན་པར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because, abiding in the emptiness of all phenomena, they do not observe anything at all that is to be gathered or not gathered.

source: །དེ་གྲོང་ཁྱེར་གྱི་གཏམ་གྱི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་ཏེ།
en: They are not preoccupied with the talk of cities.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་ནམ་མཁའ་སྟོང་པ་ཉིད་ལ་གནས་པས། ཆོས་གང་ཡང་གཟུང་བའམ། མི་གཟུང་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་།
en: If you ask why, it is because, abiding in the emptiness of space, they do not observe anything at all that is to be grasped or not grasped.

source: །དེ་གྲོང་རྡལ་གྱི་གཏམ་གྱི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་ཏེ།
en: They are not preoccupied with the talk of market towns.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་དེ་ཡང་དག་པའི་མཐའ་ལ་གནས་པས་ཆོས་གང་ཡང་འཕེལ་བའམ། འབྲི་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་ངོ་། །དེ་བདག་གིས་གཏམ་གྱི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས། སེམས་ཅན་དང་། སྲོག་དང་། འགྲོ་བ་དང་། གསོ་བ་དང་།
en: If you ask why, it is because, abiding in the very limit of reality, they do not observe anything at all that is to be enhanced or diminished.

source: སྐྱེས་བུ་དང་། གང་ཟག་དང་། ཤེད་ཅན་དང་། ཤེད་བདག་དང་། བྱེད་པ་པོ་དང་། ཚོར་བ་པོ་དང་།
en: They are not preoccupied with talk about the self, and they are not preoccupied with talk about sentient beings, life forms, living beings, life, living creatures, individual personalities, human beings, people, actors, experiencers, knowers, or viewers.

source: ཤེས་པ་པོ་དང་། མཐོང་བ་པོའི་གཏམ་གྱི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་ཏེ། གཞན་དུ་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཏམ་གྱི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་ཞིང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དང་མ་བྲལ་བར་གནས་ཏེ།
en: On the contrary, it is talk about the perfection of wisdom that they are preoccupied with, and they never part from focusing their attention with all-aspect omniscience in mind. “

source: དེ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེར་སྣའི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་སོ།
en: Practicing the perfection of generosity, they are not preoccupied with miserliness.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཚུལ་ཁྲིམས་ངན་པའི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་སོ།
en: Practicing the perfection of ethical discipline, they are not preoccupied with degenerate morality.

source: །བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། འཁྲུག་པའི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་སོ།
en: Practicing the perfection of tolerance, they are not preoccupied with agitation.

source: །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ལེ་ལོའི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་སོ།
en: Practicing the perfection of perseverance, they are not preoccupied with indolence.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། གཡེང་བའི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་སོ།
en: Practicing the perfection of meditative concentration, they are not preoccupied with distractions.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། ཤེས་རབ་འཆལ་པའི་སྦྱོར་བ་ལ་རྗེས་སུ་བརྩོན་པར་མི་གནས་སོ།
en: Practicing the perfection of wisdom, they are not preoccupied with stupidity.

source: །དེ་ཆོས་ཐམས་ཅད་སྟོང་པ་ཉིད་ལ་སྤྱོད་ཅིང་ཆོས་འདོད་པ་ཡིན་གྱི། ཆོས་མི་འདོད་པ་མ་ཡིན།
en: Conducting themselves in the emptiness of all phenomena, they wish for the Dharma and do not not wish for the Dharma.

source: དེ་ཆོས་ཀྱི་དབྱིངས་ལ་སྤྱོད་ཅིང་། ཆོས་ཐ་དད་པའི་ལེགས་པ་བརྗོད་པ་མ་ཡིན།
en: Conducting themselves in the realm of phenomena, they do not praise the diversity of phenomena. {Ki.

source: དེ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་བཤེས་གཉེན་དུ་སེམས་པ་ཡིན། རིགས་ཀྱི་བུ་དང་རིགས་ཀྱི་བུ་མོ་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་གང་ཇི་སྙེད་པ་དེ་དག་ཀྱང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་སྐུལ་ཞིང་འགོད་དོ། །འདུལ་ལོ།
en: IV: 159} “Thinking to have the lord buddhas and bodhisattva great beings as spiritual mentors, they even encourage all noble sons, noble daughters, and followers of the vehicles of the śrāvakas and the pratyekabuddhas; they establish discipline and secure them in unsurpassed, complete enlightenment.

source: །རབ་ཏུ་གཞོག་གོ། །དེ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་མཉེས་པར་བྱེད་ཅིང་བལྟ་བའི་ཕྱིར། འཇིག་རྟེན་གྱི་ཁམས་གང་ན་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དེར་སྐྱེས་ཏེ།
en: In order to please and behold the tathāgatas, arhats, completely awakened buddhas, they are consequently reborn in those world systems where they dwell and are alive at present.

source: དེར་སྐྱེ་བར་འདོད་ཅིང་འདི་ལྟར་སངས་རྒྱས་ཡིད་ལ་བྱ་བས་ཉིན་མཚན་དུ་རྣམ་པར་སྤྱོད་དེ།
en: That is to say, they wish to be reborn there and accordingly they conduct themselves focusing their attention day and night on the buddhas.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་དག་ནི་ཕལ་ཆེར་འདོད་པའི་ཁམས་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་བསྐྱེད་ཅིང་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་ལ་གནས་པས། སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ཏུ་སྐྱེ་བར་འགྱུར་རོ། །བསམ་གཏན་དང་པོ་བསྐྱེད།
en: If you ask why, Subhūti, it is because those irreversible bodhisattva great beings have given rise to that focus of their attention mostly with the realm of desire in mind, and because they abide in the ways of the ten virtuous actions, that they are reborn in those buddhafields.

source: བསམ་གཏན་གཉིས་པ་དང་། བསམ་གཏན་གསུམ་པ་དང་། བསམ་གཏན་བཞི་པ་བསྐྱེད། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ལ་སྙོམས་པར་འཇུག་པའི་བར་དུ་བསྐྱེད་ཅིང་གང་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མངོན་དུ་གྱུར་པར་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པ་དེར་སྐྱེ་སྟེ།
en: After they have cultivated the first meditative concentration, after they have cultivated the second meditative concentration, the third meditative concentration and the fourth meditative concentration, and after they have cultivated [the formless absorptions], up to and including absorption in the sphere of neither perception nor nonperception, they are reborn in those places where the tathāgatas, arhats, completely awakened buddhas are manifest and alive at present, teaching the Dharma.

source: རབ་འབྱོར་རྣམ་པ་དེ་དག་དང་ཚུལ་དེ་དག་དང་། མཚན་མ་དེ་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཕྱིར་མི་ལྡོག་པར་རིག་པར་བྱའོ། །རབ་འབྱོར་གཞན་ཡང་ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ། ནང་སྟོང་པ་ཉིད་ལ་གནས་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་གནས་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་གནས་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་གནས་པ་དང་། འཕགས་པའི་བདེན་པ་དང་བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལ་གནས་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་།
en: Subhūti, you should know that bodhisattva great beings who possess those attributes, indications, and signs are said to be irreversible. “
